doc/challenge.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-08-29 lun. 10:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>[Challenge]</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Emmanuel GALLOIS" />
<link rel="stylesheet" type="text/css" href="./css/solarized-light.min.css" />

            <link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro:400,700,400italic,700italic&subset=latin,latin-ext' rel='stylesheet' type='text/css'>
            <link href='http://fonts.googleapis.com/css?family=Source+Code+Pro:400,700' rel='stylesheet' type='text/css'>

</head>
<body>
<div id="content">
<h1 class="title">[Challenge]</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">The <i>Challenge</i></a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">The <i>Challenge</i></h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Given this csv file excerpt (the file could either be very large or small):
</p>

<pre class="example">
department;date;roomA;roomB;roomC;roomD;roomE;roomF;code
HR3;2009-01-20;19;4;3;20;40;7;HALO#sig#OPEC
HR3;2009-01-19;;5;3;20;40;7;HALO##EUR
HR1;2009-01-20;19;4;3;20;40;7;
HR2;2009-01-20;19;4;3;20;40;7;GEPUR##GBP
HR3;2009-01-21;21;89;56;12;70;91;
</pre>

<p>
Write a list of csv files by department (assume no more than 10 departments)
and room. For example, for department HR3 we would output (no need for
header):
</p>

<p>
File name: <code>HR3-RoomA.csv</code>
</p>

<p>
Contents:
</p>
<pre class="example">
HR3;2009-01-20;19;HALO;OPEC
HR3;2009-01-21;21;;
</pre>

<p>
File name: <code>HR3-RoomB.csv</code>
</p>

<p>
Contents:
</p>
<pre class="example">
HR3;2009-01-20;4;HALO;OPEC
HR3;2009-01-19;5;HALO;EUR
HR3;2009-01-21;89;
</pre>

<p>
File name: <code>HR3-RoomC.csv</code>
</p>

<p>
Contents:
</p>
<pre class="example">
HR3;2009-01-20;3;HALO;OPEC
HR3;2009-01-19;3;HALO;EUR
HR3;2009-01-21;56;;
</pre>

<p>
etc.
</p>

<p>
Take into account that sometimes when the script is run, only some data needs
to be extracted (eg. only HR1, and/or only roomA and roomB). Either one or all
departments will be processed.
</p>

<p>
To the best of your ability follow development best practices (docs, tests, etc).
</p>
</div>
</div>
</div>
</body>
</html>
